## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:283582579564:service/sre-bot-cluster/sre-bot-service"
        name                               = "sre-bot-service"
        tags                               = {
            "CostCentre" = "sre-bot"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:9" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sre-bot must be replaced
-/+ resource "aws_ecs_task_definition" "sre-bot" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:9" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8000 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "SLACK_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH"
                        },
                      - {
                          - name      = "APP_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH"
                        },
                      - {
                          - name      = "OPSGENIE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2"
                        },
                      - {
                          - name      = "PICKLE_STRING"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51"
                        },
                    ] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sre-bot-task" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.sre-bot_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "sre-bot_secrets_manager" {
        id        = "arn:aws:iam::283582579564:policy/sre-botSecretsManagerKeyRetrieval"
        name      = "sre-botSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH",
                            "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51",
                            "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2",
                            "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH",
                        ]
                        Sid      = ""
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:283582579564:parameter/sre-bot-config"
                      + Sid      = ""
                    },
                    {
                        Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:Scan",
                            "dynamodb:Query",
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                            "dynamodb:DeleteItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:ca-central-1:283582579564:table/webhooks"
                        Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.sre_bot_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.sre_bot_healthcheck"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.opsgenie_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.pickle_string"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.slack_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.sre_bot_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

38 tests, 17 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
